AutomotiveNegotiation2/IntelligentGW_SecureECU/ECU_SFW/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFuncIoPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: J15, peripheral: GPIO10, signal: 'gpio_io, 09', pin_signal: GPIO_SD_B2_00, direction: INPUT}
  - {pin_num: J14, peripheral: GPIO10, signal: 'gpio_io, 10', pin_signal: GPIO_SD_B2_01, direction: INPUT}
  - {pin_num: H13, peripheral: GPIO10, signal: 'gpio_io, 11', pin_signal: GPIO_SD_B2_02, direction: INPUT}
  - {pin_num: E15, peripheral: GPIO10, signal: 'gpio_io, 12', pin_signal: GPIO_SD_B2_03, direction: INPUT}
  - {pin_num: R10, peripheral: GPIO13, signal: 'gpio_io, 03', pin_signal: GPIO_SNVS_00, direction: OUTPUT}
  - {pin_num: P10, peripheral: GPIO13, signal: 'gpio_io, 04', pin_signal: GPIO_SNVS_01, direction: OUTPUT}
  - {pin_num: L9, peripheral: GPIO13, signal: 'gpio_io, 05', pin_signal: GPIO_SNVS_02, direction: OUTPUT}
  - {pin_num: M10, peripheral: GPIO13, signal: 'gpio_io, 06', pin_signal: GPIO_SNVS_03, direction: OUTPUT}
  - {pin_num: N10, peripheral: GPIO13, signal: 'gpio_io, 07', pin_signal: GPIO_SNVS_04, direction: OUTPUT}
  - {pin_num: P9, peripheral: GPIO13, signal: 'gpio_io, 08', pin_signal: GPIO_SNVS_05, direction: OUTPUT}
  - {pin_num: M9, peripheral: GPIO13, signal: 'gpio_io, 09', pin_signal: GPIO_SNVS_06, direction: OUTPUT}
  - {pin_num: R9, peripheral: GPIO13, signal: 'gpio_io, 10', pin_signal: GPIO_SNVS_07, direction: OUTPUT}
  - {pin_num: N9, peripheral: GPIO13, signal: 'gpio_io, 11', pin_signal: GPIO_SNVS_08, identifier: LED_RED_D5, direction: OUTPUT}
  - {pin_num: R11, peripheral: GPIO13, signal: 'gpio_io, 12', pin_signal: GPIO_SNVS_09, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFuncIoPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFuncIoPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  /* GPIO configuration of FlexSPI_B_D3 on GPIO_SD_B2_00 (pin J15) */
  gpio_pin_config_t FlexSPI_B_D3_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B2_00 (pin J15) */
  GPIO_PinInit(GPIO10, 9U, &FlexSPI_B_D3_config);

  /* GPIO configuration of FlexSPI_B_D2 on GPIO_SD_B2_01 (pin J14) */
  gpio_pin_config_t FlexSPI_B_D2_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B2_01 (pin J14) */
  GPIO_PinInit(GPIO10, 10U, &FlexSPI_B_D2_config);

  /* GPIO configuration of FlexSPI_B_D1 on GPIO_SD_B2_02 (pin H13) */
  gpio_pin_config_t FlexSPI_B_D1_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B2_02 (pin H13) */
  GPIO_PinInit(GPIO10, 11U, &FlexSPI_B_D1_config);

  /* GPIO configuration of FlexSPI_B_D0 on GPIO_SD_B2_03 (pin E15) */
  gpio_pin_config_t FlexSPI_B_D0_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B2_03 (pin E15) */
  GPIO_PinInit(GPIO10, 12U, &FlexSPI_B_D0_config);

  /* GPIO configuration of LED_RED_D1 on GPIO_SNVS_00_DIG (pin R10) */
  gpio_pin_config_t LED_RED_D1_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SNVS_00_DIG (pin R10) */
  GPIO_PinInit(GPIO13, 3U, &LED_RED_D1_config);

  /* GPIO configuration of LED_GREEN_D1 on GPIO_SNVS_01_DIG (pin P10) */
  gpio_pin_config_t LED_GREEN_D1_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SNVS_01_DIG (pin P10) */
  GPIO_PinInit(GPIO13, 4U, &LED_GREEN_D1_config);

  /* GPIO configuration of LED_RED_D2 on GPIO_SNVS_02_DIG (pin L9) */
  gpio_pin_config_t LED_RED_D2_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SNVS_02_DIG (pin L9) */
  GPIO_PinInit(GPIO13, 5U, &LED_RED_D2_config);

  /* GPIO configuration of LED_GREEN_D2 on GPIO_SNVS_03_DIG (pin M10) */
  gpio_pin_config_t LED_GREEN_D2_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SNVS_03_DIG (pin M10) */
  GPIO_PinInit(GPIO13, 6U, &LED_GREEN_D2_config);

  /* GPIO configuration of LED_RED_D3 on GPIO_SNVS_04_DIG (pin N10) */
  gpio_pin_config_t LED_RED_D3_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SNVS_04_DIG (pin N10) */
  GPIO_PinInit(GPIO13, 7U, &LED_RED_D3_config);

  /* GPIO configuration of LED_GREEN_D3 on GPIO_SNVS_05_DIG (pin P9) */
  gpio_pin_config_t LED_GREEN_D3_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SNVS_05_DIG (pin P9) */
  GPIO_PinInit(GPIO13, 8U, &LED_GREEN_D3_config);

  /* GPIO configuration of LED_RED_D4 on GPIO_SNVS_06_DIG (pin M9) */
  gpio_pin_config_t LED_RED_D4_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SNVS_06_DIG (pin M9) */
  GPIO_PinInit(GPIO13, 9U, &LED_RED_D4_config);

