AutomotiveNegotiation2/IntelligentGW_SecureECU/ECU_SFW/board/pin_mux.c
  /* GPIO configuration of LED_GREEN_D4 on GPIO_SNVS_07_DIG (pin R9) */
  gpio_pin_config_t LED_GREEN_D4_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SNVS_07_DIG (pin R9) */
  GPIO_PinInit(GPIO13, 10U, &LED_GREEN_D4_config);

  /* GPIO configuration of LED_RED_D5 on GPIO_SNVS_08_DIG (pin N9) */
  gpio_pin_config_t LED_RED_D5_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SNVS_08_DIG (pin N9) */
  GPIO_PinInit(GPIO13, 11U, &LED_RED_D5_config);

  /* GPIO configuration of LED_GREEN_D5 on GPIO_SNVS_09_DIG (pin R11) */
  gpio_pin_config_t LED_GREEN_D5_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SNVS_09_DIG (pin R11) */
  GPIO_PinInit(GPIO13, 12U, &LED_GREEN_D5_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_00_GPIO10_IO09,       /* GPIO_SD_B2_00 is configured as GPIO10_IO09 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_01_GPIO10_IO10,       /* GPIO_SD_B2_01 is configured as GPIO10_IO10 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_02_GPIO10_IO11,       /* GPIO_SD_B2_02 is configured as GPIO10_IO11 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_03_GPIO10_IO12,       /* GPIO_SD_B2_03 is configured as GPIO10_IO12 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SNVS_00_DIG_GPIO13_IO03,    /* GPIO_SNVS_00_DIG is configured as GPIO13_IO03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SNVS_01_DIG_GPIO13_IO04,    /* GPIO_SNVS_01_DIG is configured as GPIO13_IO04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SNVS_02_DIG_GPIO13_IO05,    /* GPIO_SNVS_02_DIG is configured as GPIO13_IO05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SNVS_03_DIG_GPIO13_IO06,    /* GPIO_SNVS_03_DIG is configured as GPIO13_IO06 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SNVS_04_DIG_GPIO13_IO07,    /* GPIO_SNVS_04_DIG is configured as GPIO13_IO07 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SNVS_05_DIG_GPIO13_IO08,    /* GPIO_SNVS_05_DIG is configured as GPIO13_IO08 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SNVS_06_DIG_GPIO13_IO09,    /* GPIO_SNVS_06_DIG is configured as GPIO13_IO09 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SNVS_07_DIG_GPIO13_IO10,    /* GPIO_SNVS_07_DIG is configured as GPIO13_IO10 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SNVS_08_DIG_GPIO13_IO11,    /* GPIO_SNVS_08_DIG is configured as GPIO13_IO11 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SNVS_09_DIG_GPIO13_IO12,    /* GPIO_SNVS_09_DIG is configured as GPIO13_IO12 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFuncLightingGrillPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: M14, peripheral: LPUART10, signal: TXD, pin_signal: GPIO_AD_15}
  - {pin_num: N17, peripheral: LPUART10, signal: RXD, pin_signal: GPIO_AD_16}
  - {pin_num: U8, peripheral: LPUART11, signal: TXD, pin_signal: GPIO_LPSR_08}
  - {pin_num: P5, peripheral: LPUART11, signal: RXD, pin_signal: GPIO_LPSR_09}
  - {pin_num: K14, peripheral: GPIO9, signal: 'gpio_io, 20', pin_signal: GPIO_AD_21, identifier: WHITE_LED, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: N16, peripheral: GPIO9, signal: 'gpio_io, 26', pin_signal: GPIO_AD_27, identifier: YELLOW_LED, direction: OUTPUT, gpio_init_state: 'true', pull_up_down_config: Pull_Down}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFuncLightingGrillPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFuncLightingGrillPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr);      /* LPCG on: LPCG is ON. */

  /* GPIO configuration of WHITE_LED on GPIO_AD_21 (pin K14) */
  gpio_pin_config_t WHITE_LED_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_21 (pin K14) */
  GPIO_PinInit(GPIO9, 20U, &WHITE_LED_config);

  /* GPIO configuration of YELLOW_LED on GPIO_AD_27 (pin N16) */
  gpio_pin_config_t YELLOW_LED_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_27 (pin N16) */
  GPIO_PinInit(GPIO9, 26U, &YELLOW_LED_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_15_LPUART10_TXD,         /* GPIO_AD_15 is configured as LPUART10_TXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_16_LPUART10_RXD,         /* GPIO_AD_16 is configured as LPUART10_RXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_21_GPIO9_IO20,           /* GPIO_AD_21 is configured as GPIO9_IO20 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_27_GPIO9_IO26,           /* GPIO_AD_27 is configured as GPIO9_IO26 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_08_LPUART11_TXD,       /* GPIO_LPSR_08 is configured as LPUART11_TXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_09_LPUART11_RXD,       /* GPIO_LPSR_09 is configured as LPUART11_RXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_27_GPIO9_IO26,           /* GPIO_AD_27 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
